ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкОстатковТоплива/УТЗ_ПЛ_КорректировкОстатковТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УТЗ_ПЛ_КорректировкОстатковТоплива</name>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ОстаткиТоплива</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКСписанию</registerRecords>
  <registerRecords>AccumulationRegister.УТЗ_ПЛ_ТопливоКПоступлению</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокАвтотранспортаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАвтотранспорта</name>
    <attributes>
      <name>Автотранспорт</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.УТЗ_ПЛ_ВидыДвиженийКорректировок</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокТекущий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокСкорректированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/AccumulationRegisters/УТЗ_ПЛ_ОстаткиТоплива/УТЗ_ПЛ_ОстаткиТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УТЗ_ПЛ_ОстаткиТоплива</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыДвиженийКорректировок/УТЗ_ПЛ_ВидыДвиженийКорректировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыДвиженийКорректировок</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Documents/УТЗ_ПЛ_КорректировкОстатковТоплива/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УТЗ_ПЛ_ОстаткиТоплива.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.Автотранспорт КАК Автотранспорт,
	|	УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.ВидДвижения КАК ВидДвижения,
	|	СУММА(УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.Количество) КАК Количество
	|ИЗ
	|	Документ.УТЗ_ПЛ_КорректировкОстатковТоплива.СписокАвтотранспорта КАК УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта
	|ГДЕ
	|	УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.Автотранспорт,
	|	УТЗ_ПЛ_КорректировкОстатковТопливаСписокАвтотранспорта.ВидДвижения";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.УТЗ_ПЛ_ОстаткиТоплива.Добавить();
		Если Выборка.ВидДвижения = Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Приход Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата; // чтобы не было конфликтов при проведении 1 автомобиля по разным движениям
		ИначеЕсли Выборка.ВидДвижения = Перечисления.УТЗ_ПЛ_ВидыДвиженийКорректировок.Расход Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата + 1; // чтобы не было конфликтов при проведении 1 автомобиля по разным движениям
		КонецЕсли;
		
		Движение.Автотранспорт = Выборка.Автотранспорт;
		Движение.Количество = Выборка.Количество;
		Движение.Ответственный = Ответственный;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивАвтотранспорта = СписокАвтотранспорта.ВыгрузитьКолонку("Автотранспорт");
	МассивБезДубликатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивАвтотранспорта);
	СписокАвтотранспортаСтрокой = СтрСоединить(МассивБезДубликатов, ", ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
